// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "此软件必须安装在一个启动卷宗。";
"ERROR_INSTALL" = "此卷宗未符合此更新所需的要求。";

"Newer_Package_Installed_message" = "系统中已安装了一个较新版本的 Chameleon 。";
"Intel_Mac_message" = "此软件无法在此电脑上安装。";


// ============================================================================
// Install Type
// ----------------------------------------------------------------------------
"InstallType_title" = "安装类型";
"InstallType_description" = "选择进行全新安装或更新安装。";

"New_title" = "全新安装";
"New_description" = "备份目标分区已存在的 /Extra 目录。如果选取 boot 以外的其他安装选项，将备份原有的 /Extra 设置文件，并建立新的 /Extra 设置文件。";

"Upgrade_title" = "更新安装";
"Upgrade_description" = "合并目标分区已存在的 /Extra 目录。如果选取 boot 以外的其他安装选项，将合并原有的 /Extra 设置文件。";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Chameleon";
"Chameleon_description" = "简而言之，变色龙需要三个必要的文件。
boot0 (在硬盘的 MBR) 负责载入 boot1。
boot1 (在分区的开机磁区 boot-sector) 搜寻 boot2。
boot2 (在分区的根目录) 载入系统内核等等。";

"Standard_title" = "标准安装";
"Standard_description" = "此选项会安装三个必要文件，并依照您的系统需求将 boot0 或 boot0md 写入 MBR 的前 440 位元，以避免损坏任何已经存在的 Windows 机码。然后 boot0 会在第一个启动分区搜寻 boot1h，而 boot0md 可以在第二个硬盘的第一个启动分区搜寻 boot1h。";

"EFI_title" = "EFI 安装";
"EFI_description" = "此选项会安装三个必要文件到正常隐藏的 EFI 分区，并依照您的系统需求将 boot0 或 boot0md 写入 MBR 的前 440 位元，以避免损坏任何已经存在的 Windows 机码。然后 boot0 会在第一个启动分区搜寻 boot1h，而 boot0md 可以在第二个硬盘的第一个启动分区搜寻 boot1h。";

"noboot_title" = "皆不安装";
"noboot_description" = "不安装变色龙引导器 (适用于仅安装 Extra 组件)。";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "模块选项";
"Module_description" = "The modules system incorporated in chameleon allows for a user or developer to extend the core functionality of chameleon without replacing the main boot file.";

"AMDGraphicsEnabler_title" = "AMDGraphicsEnabler";
"AMDGraphicsEnabler_description" = "启用 AMD 显卡插件 ( Rev 784 以上 版本适用)。
该插件不支持“古老的” ATI 显卡。
如果您的 HD 系列显卡在早先的代码中被支持却被本插件遗漏，请于 http://forge.voodooprojects.org/p/chameleon/issues/ 指正，其他 ATI 代码的遗误同此处理。仅确认可驱动显卡被列入此代码。";

"ATiGraphicsEnabler_title" = "ATiGraphicsEnabler";
"ATiGraphicsEnabler_description" = "启用 ATi 显卡插件 ( Rev 784 以下 版本适用)。
支持“古老的”显卡....
基于 Meklort 的工作。";

"IntelGraphicsEnabler_title" = "IntelGraphicsEnabler";
"IntelGraphicsEnabler_description" = "启用 Intel 显卡插件，完美驱动一些 Intel 显卡，移动版为主。";

"klibc_title" = "klibc";
"klibc_description" = "模块安装位置 /Extra/modules/klibc.dylib
此模块在 Chameleon 的 library 不敷使用时，可提供一个标准的 c library 给其他模块链结使用 。
目前仅有 uClibc++ library 链结使用。
源代码: http://www.kernel.org/pub/linux/libs/klibc/ ";

"AutoReso_title" = "Resolution";
"AutoReso_description" = "模块安装位置 /Extra/modules/Resolution.dylib
此模块会从连接的主要显示器中，读取其屏幕的 EDID 信息。
这个模块目前并未整合到 trunk 版本内，而是采独立运作。
另外，此模块会修正早期 Intel HD 显卡的 VESA 模式，可在开机引导時，采用正确的分辨率。";

"NVIDIAGraphicsEnabler_title" = "NVIDIAGraphicsEnabler";
"NVIDIAGraphicsEnabler_description" = "启用 nVidia 显卡插件。
如果您的显卡可以支持，却被此代码遗漏，请于 http://forge.voodooprojects.org/p/chameleon/issues/ 指正。仅确认可驱动显卡被列入此代码。";

"uClibc_title" = "uClibc++";
"uClibc_description" = "模块安装位置 /Extra/modules/uClibcxx.dylib
此模块提供一个精简的 c++ runtime library 给其他模块链结使用。
模块本身不提供任何功能，而是用来允许其他模块可使用 c++ 语言。
请注意 rtti 和 例外 都已被禁用。
源代码: http://cxx.uclibc.org/
依存: klibc ";

"Keylayout_title" = "Keylayout";
"Keylayout_description" = "模块安装位置 /Extra/modules/Keylayout.dylib
键盘布局，此模块允许用户定义键盘按键的映射。";

// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "工具选项";
"Utility_description" = "协助安装设置的文件。";

"PrefPanel_title" = "系统偏好设置面板";
"PrefPanel_description" = "安装 Chameleon 系统偏好设置面板。";

"SMBIOSDefault_title" = "SMBios.plist";
"SMBIOSDefault_description" = "复制 smbios.plist 范例 至 /Extra/Configuration。";

"Documentation_title" = "说明文件";
"Documentation_description" = "Chameleon 手动安装及使用的说明文件。";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "开机选项";
"Options_description" = "创建 /Extra/org.chameleon.Boot.plist 及选用您需要的 Chameleon 开机选项及内核参数。";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "(默认是 Yes) 隐藏 图形用户介面的 Chameleon 开机选单。";

"GUI_title" = "GUI=No";
"GUI_description" = "(默认是 Yes) 禁用 默认开启之图形用户介面。";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "(默认是 No) 开机画面使用传统的 Apple Logo(白底灰苹果)，而不使用主题内所定义之 boot.png。";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "(默认是 No) 跳过倒数画面，直接显示分区开机选择画面。";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "(默认是 No) 启用静默开机模式(不会出现信息或提示)。";

"ShowInfo_title" = "ShowInfo=Yes";
"ShowInfo_description" = "(默认是 No) 启用 在开机图示选单左上方显示分区及分辨率的详细信息的功能。虽然会与一些背景主题发生冲突，在问题排除时，却是非常有用的信息。";

"Wait_title" = "Wait=Yes";
"Wait_description" = "(默认是 No) 在 Chameleon 载入完毕后暂停，并在 按任意键 后继续载入 mach kernel，适合问题排除时搭配 (-v) 啰唆模式开机一起使用。";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "(默认是 64 位) 启用 32 位模式引导内核开机，而非默认的 64 位开机。";

"EHCIacquire_title" = "EHCIacquire=Yes";
"EHCIacquire_description" = "(默认是 No) 启用 EHCI 修正功能，可修复任何不良 BIOS 造成的 EHCI 所有权问题。";

"EthernetBuiltIn_title" = "EthernetBuiltIn=Yes";
"EthernetBuiltIn_description" = "(默认是 No) 启用将以太网卡设置成‘内建’的功能。此功能只可让网卡识别为内建，并无驱动的功能。";

"ForceHPET_title" = "ForceHPET=Yes";
"ForceHPET_description" = "(默认是 No) 对 BIOS 中无 HPET 选项之 Intel 芯片组主板，强制开启 HPET 功能。";

"ForceWake_title" = "ForceWake=Yes";
"ForceWake_description" = "(默认是 No) 启用强制覆盖睡眠资料映像功能，此选项可以覆盖并忽略不正确之休眠映像文件。";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "(默认是 Yes) 禁用 自动启用的重新开机修正功能 (Intel CPU 专用)。";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "(默认是 No) 启用 UHCI 修正功能。可在进入 OS X 之前，先重置 UHCI 控制器。";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "(默认是 Yes) 禁用 自动启用的内存识别功能。";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "(默认是 No) Lion 专用，选用 Yes 将载入预链接的 KernelCache，并忽略 /Extra/Extensions 和 /System/Library/Extensions 及 Extensions.mkext。建议在 KernelCache 已内含所有必要的驱动时，才启用。";

"Wake_title" = "Wake=Yes";
"Wake_description" = "(默认是 No) 启用睡眠唤醒功能，尝试载入最后一次休眠时保存的睡眠映像。";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "Generate C-States New=Yes";
"CSTUsingSystemIO_description" = "(默认是 No) 采用 SystemIO registers 生成 C-States _CST 的新方法。(非原来的 FixedHW 方法)";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "(默认是 No) 设置 Yes 忽略主板 BIOS 内建之 SSDT 表，可读取 Extra 文件夹中的 SSDT 资料。/Extra/SSDT.aml。";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "(默认是 No) 强制生成 C2 State 为管理 CPU 电源状态，可以让 CPU 在闲置状态下处于低功耗状态。一般来说数字越大其节能效果愈佳。";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "(默认是 No) 强制生成 C3 State 为管理 CPU 电源状态，可以让 CPU 在闲置状态下处于低功耗状态。一般来说数字越大其节能效果愈佳。";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "(默认是 No) 强制生成 C4 State 为管理 CPU 电源状态，可以让 CPU 在闲置状态下处于低功耗状态。一般来说数字越大其节能效果愈佳。";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "(默认是 No) 启用自动生成 CPU 闲置休眠状态的功能 (C-States)，管理 CPU 电源状态，可以让 CPU 在闲置状态下处于不同低功耗状态。";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "(默认是 No) 启用自动生成 CPU 功耗表现状态的功能 (P-States)，管理 CPU 性能状态，可以让 CPU 在不同负载量下改变功耗。";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "设置显示器分辨率为 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "设置显示器分辨率为 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "设置显示器分辨率为 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "设置显示器分辨率为 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "设置显示器分辨率为 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "设置显示器分辨率为 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "设置显示器分辨率为 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "设置显示器分辨率为 1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "设置显示器分辨率为 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "设置显示器分辨率为 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "设置显示器分辨率为 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "(默认是 No) 启用显卡侦测功能。自动识别 显卡 GPU 并注入正确的设备属性信息。";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "(默认是 No) 启用 ATI EEPRom 功能，可在不刷显卡 BIOS 的情况下使用修改的 Rom。请命名为 “VenderID_DeviceID_SubsysID.rom” 放置 Extra 文件夹。如：/Extra/1002_68C1_FD501179.rom。";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "(默认是 No) 启用 Nvidia EEPRom 功能，可在不刷显卡 BIOS 的情况下使用修改的 Rom。请命名为 “VenderID_DeviceID.rom” 放置 Extra 文件夹。如：/Extra/10de_0614.rom。";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "(默认是 No) 启用 Nvidia VBIOS 功能。仅针对 Nvidia 显卡的参数选项，ATI 显卡请勿使用。启用读取显卡参数，可在显卡信息中显示 ROM 修正版 信息。";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "-v 啰唆模式";
"Verbose_description" = "使用 (-v) 啰唆模式进入，允许您在显示器上读取 变色龙 和 OS X 内核 两者在开机时产生的纪录信息。这是在开机时排除问题的基本用法。";

"Singleusermode_title" = "-s 单用户模式";
"Singleusermode_description" = "使用 (-s) 单用户模式进入，在排除问题时，可于在开机使用 (-s) 进入 OS X 的 BSD/Unix 命令模式。";

"Ignorecaches_title" = "-f 忽略 Caches";
"Ignorecaches_description" = "使用 (-f) 忽略 Caches 模式进入，并非每日开机必备的的选项，但可经由忽略预制的 Caches ，以使 OS X 可以重新载入所有位于系统目录的 kext 文件。";

"Npci_title" = "npci=0x2000";
"Npci_description" = "可在某些系统上排除 'PCI configuration begin' 的错误。0x2000 是 kIOPCIConfiguratorPFM64 flag，可在 IOPCIFamily 的 source code 中找到相关信息。";

"Npci3_title" = "npci=0x3000";
"Npci3_description" = "可在某些系统上排除 'PCI configuration begin' 的错误。0x3000 是 kIOPCIConfiguratorPFM64 flag，可在 IOPCIFamily 的 source code 中找到相关信息。";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Lion 专用。禁用 'low power wake' 的功能，在显示器睡眠唤醒之后，有时可能会发生显示器黑屏的状况。";


// ----------------------------------------------------------------------------
// Boot options - KEYMAPS
// ----------------------------------------------------------------------------

"mac-de_title" = "德语 Mac 键盘布局";
"mac-de_description" = "使用德国的 Mac 键盘的键盘布局";

"mac-es_title" = "西班牙语 Mac 键盘布局";
"mac-es_description" = "使用西班牙的 Mac 键盘的键盘布局";

"mac-fr_title" = "法语 Mac 键盘布局";
"mac-fr_description" = "使用法国的 Mac 键盘的键盘布局";

"mac-it_title" = "意大利语 Mac 键盘布局";
"mac-it_description" = "使用意大利的 Mac 键盘的键盘布局";

"mac-se_title" = "瑞典语 Mac 键盘布局";
"mac-se_description" = "使用瑞典的 Mac 键盘的键盘布局";

"mac-pt_title" = "Portuguese Mac Keyboard";
"mac-pt_description" = "Use the keyboard layout for a Portuguese Mac keyboard";

"pc-de_title" = "German PC Keyboard";
"pc-de_description" = "Use the keyboard layout for a German PC keyboard";

"pc-es_title" = "Spanish PC Keyboard";
"pc-es_description" = "Use the keyboard layout for a Spanish PC keyboard";

"pc-fr_title" = "法语 PC 键盘布局";
"pc-fr_description" = "使用法国的 PC 键盘的键盘布局";

"pc-it_title" = "Italian PC Keyboard";
"pc-it_description" = "Use the keyboard layout for a Italian PC keyboard";

"pc-se_title" = "Swedish PC Keyboard";
"pc-se_description" = "Use the keyboard layout for a Swedish PC keyboard";

"pc-pt_title" = "Portuguese PC Keyboard";
"pc-pt_description" = "Use the keyboard layout for a Portuguese PC keyboard";

// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "内崁主题";
"Embed_description" = "Embed：小而简单且可于编译 boot 时，内崁在 Chameleon 里的主题.";

"Legacy_title" = "传统主题";
"Legacy_description" = "Legacy：Chameleon v2.0 RC1 的原始默认主题.";

"Default_title" = "默认主题";
"Default_description" = "Default：Chameleon v2.0 RC5 的新版默认主题.";

"Bullet_title" = "子弹主题";
"Bullet_description" = "Bullet：来自 NoSmokingBandit 2009.4 的一个小巧可爱的子弹主题.";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "控制选项";
"Control_description" = "设置控制 Chameleon 的运作方式。";

// General
"General_title" = "一般选项";
"General_description" = "选取一些基本的选项。";

// KernelFlags
"KernelFlags_title" = "内核参数";
"KernelFlags_description" = "选取有关 kernel flags 的各种内核参数设置。另可于开机时，键入以下命令配合使用。";

// PowerManagement
"PowerManagement_title" = "电源管理";
"PowerManagement_description" = "一些设置电源管理和 speedstep 的选项。";

// Resolution
"Resolution_title" = "分辨率设置";
"Resolution_description" = "Set one resolution to use.";

// Video
"Video_title" = "显卡选项";
"Video_description" = "一些设置显卡的选项。";

// Keymaps
"Keymaps_title" = "键盘布局";
"Keymaps_description" = "Select one keylayout to use. This will also install the Keylayout module and keymaps.";

// Themes
"Themes_title" = "主题选项";
"Themes_description" = "选集的一些主题范例。
可在 http://forum.voodooprojects.org/index.php/board,7.0.html 找到更多的主题。";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "不安装";
"ChooseNone-Resolution_description" = "不选取安装任何显示器分辨率。";

"ChooseNone-keylayout_title" = "不安装";
"ChooseNone-keylayout_description" = "不选取安装任何键盘布局。";
